In [60]:
import pandas as pd
import numpy as np
from sqlalchemy import text, create_engine
from env import get_connection

Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

4. Use your function to obtain a connection to the employees database.

In [62]:
url = get_connection

In [87]:
url = get_connection('employees')

In [88]:
engine = create_engine(url)

In [92]:
query = '''
        SELECT *
        FROM employees
        '''

In [91]:
text_query = text(query)

In [95]:
df = pd.read_sql(text_query, engine.connect())
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

5. Once you have successfully run a query:
    

a. Intentionally make a typo in the database url. What kind of error message do you see?

6. Read the employees and titles tables into two separate DataFrames.

In [98]:
titles = text('''
        SELECT * FROM titles
        ''')
t = pd.read_sql(titles,engine.connect())
t.head(3)

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01

How many rows and columns do you have in each DataFrame? Is that what you expected?

In [99]:
e.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

#30024

Display the summary statistics for each DataFrame.

In [100]:
e.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

How many unique titles are in the titles DataFrame?

In [101]:
t['title'].nunique()

7

What is the oldest date in the to_date column?

In [102]:
t.sort_values(by='to_date',ascending=True).head(3)

        emp_no     title   from_date     to_date
16064    20869  Engineer  1985-02-17  1985-03-01
406358  474918  Engineer  1985-02-10  1985-03-11
346216  434232     Staff  1985-02-26  1985-03-20

What is the most recent date in the to_date column?